IDEA StatiCa Open Model
ConnectionSetup Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ConnectionSetup type exposes the following members.
Properties
Name | Description
AlphaCC
 Long-term effect on fcd
AnalysisGNL
 Analysis with GNL
AnchorLengthForStiffness
 Length of anchor to define the anchor stiffness in analysis model, as a multiple of anchor diameter (E A /n * [d])
ApplyBearingCheck
 ApplyBearingCheck
ApplyBetapInfluence
 Apply βp influence in bolt shear resistance. ΕΝ 1993-1-8 chapter 3.6.1 (12)
ApplyConeBreakoutCheck
 Apply cone breakout check
BaseMetalCapacity
 BaseMetalCapacity
BearingAngle
 Load distribution angle of concrete block in calculation of factor Kj
BearingCheck
 Apply bearing check including αb
BoltMaxGripLengthCoeff
 Max value of bolt grip
BracedSystem
 Consider the frame system as braced for stiffness calculation. Braced system reduces horizontal displacements.
ConcreteSetup |  Obsolete.
 Concrete setup
CrackedConcrete
 True if cracked concrete is considered
CrtCompCheckIS
 Crt check type
DecreasingFtrd
 Decreasing Ftrd of anchors. Worse quality influence
DistanceBetweenBolts
 Limit distance between bolts as a multiple of bolt diameter
DistanceBetweenBoltsEdge
 Limit distance between bolt and plate edge as a multiple of bolt diameter
DistanceDiameterBetweenBP
 Anchor pitch
DivisionOfArcsOfRHS
 Number of straight lines to substitute corner arc of rectangular tubes in analysis model
DivisionOfSurfaceOfCHS
 Number of straight lines to substitute circle of circular tube in analysis model
EffectiveAreaStressCoeff
 Effective area is taken from intersection of stress area and area of joined items according to EN1993-1-8 art. 6.2.5
ExtensionLengthRationCloseSections
 ExtensionLengthRationCloseSections
ExtensionLengthRationOpenSections
 ExtensionLengthRationOpenSections
FactorPreloadBolt
 FactorPreloadBolt
FrictionCoefficient
 Coefficient of friction between base plate and concrete block
FrictionCoefficientPbolt
 Friction factor of slip-resistant joint
GammaC
 Partial safety factor of concrete
GammaInst
 Partial safety factor of instalation safety
GammaM3
 Preloaded bolts safety factor
CheckDetailing
 Perform check of bolt positions
JointBetaFactor
 Joint coefficient βj - Used for Fjd calculation
LimitDeformation
 Limit deformation on closed sections
LimitDeformationCheck
 Limit deformation on closed sections check or not
LimitPlasticStrain
 Limit of plastic strain used in 2D plate element check
MaxSize
 Maximal size of generated finite mesh element
Mdiv
 Number of iteration steps to evaluate analysis divergence
MemberLengthRatio
 A multiple of cross-section height to determine the default length of member
MinSize
 Minimal size of generated finite mesh element
NumberIterations
 More iterations helps to find better solutions in contact elements but increases calculation time
NumElement
 Ratio of length of decisive plate edge and Elements on edge count determines the average size of mesh element
NumElementRhs
 Number of mesh elements in RHS height
OptimalCheckLevel
 Optimal check level
PretensionForceFpc
 Pretension force fpc = k * fub * As
RigidBP
 True if rigid base plate is considered
SteelSetup
 Steel Setup
StopAtLimitStrain
 Stop analysis when the limit strain is reached.
WarnCheckLevel
 Warning check level
WarnPlasticStrain
 Warning plastic strain
WeldEvaluationData
 Method of evaluation of stress in welds
Top
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace